// 2.1 Вывести матрицу таблицы умножения.

console.log(`Задание 2.1`);

const a = [];
for (let i = 0; i < 10; i += 1) {
    a.push([]);
    for (let j = 0; j < 10; j += 1) {
        a[i].push(i * j);
    }
}

console.log(a);
console.table(a);

// 2.2 Посчитать сумму чисел находящихся на главной диагонали.

console.log(`Задание 2.2`);

let sum = 0;

sum = a[0][0] + a[1][1] + a[2][2] + a[3][3] + a[4][4] + a[5][5] + a[6][6] + a[7][7] + a[8][8] + a[9][9];

console.log(`Сумма чисел находящихся на главной диагонали = ${sum}`);